## Website CMS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.website-cms-ecs will be updated in-place
  ~ resource "aws_ecs_service" "website-cms-ecs" {
        id                                 = "arn:aws:ecs:ca-central-1:773858180673:service/website-cms-cluster/website-cms-ecs"
        name                               = "website-cms-ecs"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:61" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.cds-website-cms must be replaced
-/+ resource "aws_ecs_task_definition" "cds-website-cms" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:60" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 1337 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  ~ secrets          = [
                        # (1 unchanged element hidden)
                        {
                            name      = "TOKEN"
                            valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"
                        },
                      - {
                          - name      = "AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/aws_access_key_id"
                        },
                      - {
                          - name      = "AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/aws_secret_access_key"
                        },
                        {
                            name      = "ADMIN_JWT_SECRET"
                            valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "website-cms-task" -> (known after apply)
      ~ revision                 = 60 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.ecs-task-execution will be updated in-place
  ~ resource "aws_iam_policy" "ecs-task-execution" {
        id        = "arn:aws:iam::773858180673:policy/WebsiteTaskExecutionPolicies"
        name      = "WebsiteTaskExecutionPolicies"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "ssm:DescribeParameters"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password",
                          - "arn:aws:ssm:ca-central-1:773858180673:parameter/website/aws_secret_access_key",
                          - "arn:aws:ssm:ca-central-1:773858180673:parameter/website/aws_access_key_id",
                            "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.aws_access_key_id will be destroyed
  - resource "aws_ssm_parameter" "aws_access_key_id" {
      - allowed_pattern = "" -> null
      - arn             = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/aws_access_key_id" -> null
      - data_type       = "text" -> null
      - description     = "" -> null
      - id              = "/website/aws_access_key_id" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/website/aws_access_key_id" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value)
      - version         = 1 -> null
    }

  # aws_ssm_parameter.aws_secret_access_key will be destroyed
  - resource "aws_ssm_parameter" "aws_secret_access_key" {
      - allowed_pattern = "" -> null
      - arn             = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/aws_secret_access_key" -> null
      - data_type       = "text" -> null
      - description     = "" -> null
      - id              = "/website/aws_secret_access_key" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/website/aws_secret_access_key" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value)
      - version         = 1 -> null
    }

Plan: 1 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.cms-load-balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.front_end"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.s3_distribution"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.website-cms-database"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.image-repository"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.website-cms-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.website-cms-ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs-task-execution"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs-task-execution-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cw"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
